//#include<stdio.h>
//
//int main()
//{
//	// 변수를 만들때
//	// DataType 변수명 ; <- 세미콜론의 역할은 명령이 끝났다 라는 의미로 사용.
//	// 변수명은 영대소문자, 숫자, _을 쓸수 있다. 단, 숫자는 첫글자로 사용할수 없음.
//	// short a1;는 되지만 short 1a; 는 사용할 수 없다.
//	// 변수명의 길이는 표준 31문자, 비주얼 스튜디오는 128문자까지 쓸수 있다.
//	// 앞에 //를 입력하면 주석처리, 주석은 개발자가 메모하는 용도로 쓰는 것
//	// 블럭을 잡아서 주석 만들땐 앞에 /* 뒤에 */ 입력하면 된다.
//
//	// 변수명의 명명규칙은 저장공간의 용도나 역할을 설명하는 단어나 문장을 사용하면 됨
//	int score; // 이런식으로 명명하는 것.
//	int isLive;
//
//
// 
	//short plusA;   // short형 plusA 변수를 만듦
	//short minusA;   // short형 minusA 변수를 만듦

	//plusA = 32767;   // plusA변수에 32767의 값을 저장함.
	//minusA = -32768; // minusA 변수에 -32768의 값을 저장함.

	//// plusA와 minusA라는 변수명은 나중에 실행할때 만들어질 메모리 공간을 대신
	//// 하고 있습니다.
	//// plusA와 minusA라는 변수명은 여러분들이 코딩작업을 할때만 의미가 있습니다.


	//// 값을 출력할때 printf라는 함수를 사용합니다.
	//// printf함수 콘솔창에 문자열을 출력할때 사용합니다.
	//// printf함수는 형식지정문자열을 지원합니다.
	//printf("plusA = %d, minusA = %d\n", plusA, minusA);
//
//
//	return 0;
//}